In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    "clm1":[1,2,3,4,5,6],
    "clm2":[100,100,200,300,300,100],
    "clm3":["Mustafa","Kamil","Emre","Murat","Ayse","Zeynep"]
})

In [4]:
df

   clm1  clm2     clm3
0     1   100  Mustafa
1     2   100    Kamil
2     3   200     Emre
3     4   300    Murat
4     5   300     Ayse
5     6   100   Zeynep

In [6]:
df.head(3)

   clm1  clm2     clm3
0     1   100  Mustafa
1     2   100    Kamil
2     3   200     Emre

In [9]:
df["clm2"].unique()

array([100, 200, 300], dtype=int64)

In [10]:
df["clm2"].nunique()

3

In [12]:
df["clm2"].value_counts()

100    3
300    2
200    1
Name: clm2, dtype: int64

In [13]:
df[df["clm1"] >=4]

   clm1  clm2    clm3
3     4   300   Murat
4     5   300    Ayse
5     6   100  Zeynep

In [15]:
df[(df["clm1"] >=4) &( df["clm2"] ==300) ]

   clm1  clm2   clm3
3     4   300  Murat
4     5   300   Ayse

In [16]:
df

   clm1  clm2     clm3
0     1   100  Mustafa
1     2   100    Kamil
2     3   200     Emre
3     4   300    Murat
4     5   300     Ayse
5     6   100   Zeynep

In [17]:
def time3(x):
    return x *3

In [18]:
time3(6)

18

In [24]:
df["clm2"].apply(time3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: clm2, dtype: int64

##

In [25]:
df

   clm1  clm2     clm3
0     1   100  Mustafa
1     2   100    Kamil
2     3   200     Emre
3     4   300    Murat
4     5   300     Ayse
5     6   100   Zeynep

In [26]:
 datalambda =lambda  x : x*2

In [28]:
datalambda(4)

8

In [29]:
df["clm2"].apply(lambda x : x*2)

0    200
1    200
2    400
3    600
4    600
5    200
Name: clm2, dtype: int64

In [30]:
df["clm3"].apply(len)

0    7
1    5
2    4
3    5
4    4
5    6
Name: clm3, dtype: int64

In [32]:
#delete to column
df.drop("clm3",axis =1)

   clm1  clm2
0     1   100
1     2   100
2     3   200
3     4   300
4     5   300
5     6   100

In [33]:
df.drop("clm3",axis =1 ,inplace =True)

In [34]:
df

   clm1  clm2
0     1   100
1     2   100
2     3   200
3     4   300
4     5   300
5     6   100

In [35]:
df.columns

Index(['clm1', 'clm2'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [37]:
len(df.index)

6

In [38]:
df.index.names

FrozenList([None])

In [39]:
df

   clm1  clm2
0     1   100
1     2   100
2     3   200
3     4   300
4     5   300
5     6   100

In [44]:
df.sort_values("clm2",ascending=False)

   clm1  clm2
3     4   300
4     5   300
2     3   200
0     1   100
1     2   100
5     6   100

In [45]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [46]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [47]:
df.pivot_table(index = "Şehir",columns ="Ay",values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [48]:
df.pivot_table(index = "Ay",columns ="Şehir",values = "Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [49]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75